#include <iostream>
#include <vector>
#include <chrono>
#include <random>

void InsertionSort(std::vector<int>& arr) {
  // Сравнения Перестановки
  int k1 = 0, k2 = 0;

  for (int i = 1; k1++, i < arr.size(); ++i) {

    const int cur = arr[i];
    int j = i - 1;

    k1++;
    while (j >= 0 && arr[j] > cur) {
      arr[j + 1] = arr[j];
      j -= 1;

      k1++;
      k2++;
    }
    arr[j + 1] = cur;
    k2++;

  }
  std::cout << "Insert: " << k1 << " | " << k2 << '\n';
}

void ShellSort(std::vector<int>& arr) {
  int k1 = 0, k2 = 0;

  for (int gap = arr.size() / 2; k1++, gap > 0; gap /= 2) {

    for (int i = gap; k1++, i < arr.size(); ++i) {
      int cur = arr[i];

      int j;
      for (j = i; k1++, j >= gap && arr[j - gap] > cur; j -= gap) {
        arr[j] = arr[j - gap];
        k2++;
      }

      arr[j] = cur;
      k2++;
    }
  }
  std::cout << "Shell: " << k1 << " | " << k2 << '\n';
}

void PrintVector(std::vector<int>& arr) {
  for (int i = 0; i < arr.size() - 1; ++i) {
    std::cout << arr[i] << ", ";
  }
  std::cout << arr[arr.size() - 1] << '\n';
}

/*  Результат работы (СРАВНЕНИЯ | ПЕРЕСТАНОВКИ):

    TEST1 N=64:
    Insert: 1147 | 1083
    Shell: 867 | 533

    TEST1 N=63:
    Insert: 903 | 840
    Shell: 687 | 418

    TEST1 N=100:
    Insert: 2767 | 2667
    Shell: 1378 | 862

    TEST1 N=10:
    Insert: 40 | 30
    Shell: 64 | 35

    TEST1 N=12:
    Insert: 60 | 48
    Shell: 81 | 48

    Таким образом, при больших N Shell (интервал - N/2) показывает себя лучше - меньше сравнений, меньше перестановок.
    При этом разница возрастает с ростом N.
*/

int main() {
  // constexpr int N = 12;
  // std::mt19937 rng(std::chrono::steady_clock::now().time_since_epoch().count());
  // std::uniform_int_distribution<int> distribution(1, 100);
  // std::vector<int> random_array(N);
  //
  // for (int i = 0; i < N; ++i) {
  //   random_array[i] = distribution(rng);
  // }
  // PrintVector(random_array);

  // TEST 1: N=64
  std::vector<int> arr = {70, 30, 21, 9, 51, 37, 45, 53, 53, 44, 71, 15, 8, 40, 51, 36, 93, 10, 60, 79, 38, 12, 91, 97,
                          47, 68, 39, 68,
                          76, 56, 74, 80, 35, 50, 82, 65, 23, 58, 70, 66, 12, 22, 50, 58, 21, 1, 2, 76, 47, 9, 18, 93,
                          1, 93, 8, 97, 68, 32, 44, 6, 42, 16,
                          45, 76};
  InsertionSort(arr);

  arr = {70, 30, 21, 9, 51, 37, 45, 53, 53, 44, 71, 15, 8, 40, 51, 36, 93, 10, 60, 79, 38, 12, 91, 97, 47, 68, 39, 68,
         76, 56, 74, 80, 35, 50, 82, 65, 23, 58, 70, 66, 12, 22, 50, 58, 21, 1, 2, 76, 47, 9, 18, 93, 1, 93, 8, 97, 68,
         32, 44, 6, 42, 16,
         45, 76};
  ShellSort(arr);

  // TEST 2: N=63
  arr = {2, 25, 13, 98, 78, 30, 33, 95, 44, 28, 72, 59, 90, 52, 14, 31, 51, 11, 54, 51, 96, 1, 94, 31, 2, 68, 33, 32,
         93, 77, 61,
         76, 2, 79, 34, 37, 42, 26, 62, 46, 76, 61, 32, 73, 86, 32, 99, 91, 1, 75, 78, 89, 57, 76, 70, 40, 45, 76, 5,
         76, 82, 98, 83};
  InsertionSort(arr);

  arr = {2, 25, 13, 98, 78, 30, 33, 95, 44, 28, 72, 59, 90, 52, 14, 31, 51, 11, 54, 51, 96, 1, 94, 31, 2, 68, 33, 32,
         93, 77, 61,
         76, 2, 79, 34, 37, 42, 26, 62, 46, 76, 61, 32, 73, 86, 32, 99, 91, 1, 75, 78, 89, 57, 76, 70, 40, 45, 76, 5,
         76, 82, 98, 83};
  ShellSort(arr);

  // TEST 3: N=100:
  arr = {100, 93, 67, 25, 35, 91, 54, 97, 28, 7, 19, 100, 26, 65, 55, 44, 85, 33, 23, 54, 26, 73, 24, 76, 30, 43, 42,
         76, 65, 66,
         62, 63, 14, 100, 48, 83, 13, 52, 49, 39, 49, 45, 51, 92, 11, 28, 21, 17, 79, 57, 15, 7, 90, 92, 53, 28, 33, 44,
         78, 35,
         85, 66, 33, 28, 73, 56, 25, 10, 43, 97, 63, 43, 72, 21, 69, 65, 52, 63, 94, 25, 18, 32, 21, 56, 9, 53, 34, 51,
         33, 63,
         8, 13, 57, 16, 71, 81, 95, 92, 93, 23};
  InsertionSort(arr);

  arr = {100, 93, 67, 25, 35, 91, 54, 97, 28, 7, 19, 100, 26, 65, 55, 44, 85, 33, 23, 54, 26, 73, 24, 76, 30, 43, 42,
         76, 65, 66,
         62, 63, 14, 100, 48, 83, 13, 52, 49, 39, 49, 45, 51, 92, 11, 28, 21, 17, 79, 57, 15, 7, 90, 92, 53, 28, 33, 44,
         78, 35,
         85, 66, 33, 28, 73, 56, 25, 10, 43, 97, 63, 43, 72, 21, 69, 65, 52, 63, 94, 25, 18, 32, 21, 56, 9, 53, 34, 51,
         33, 63,
         8, 13, 57, 16, 71, 81, 95, 92, 93, 23};
  ShellSort(arr);

  // TEST 4: N=10
  arr = {38, 90, 82, 98, 11, 16, 81, 42, 57, 97};
  InsertionSort(arr);

  arr = {38, 90, 82, 98, 11, 16, 81, 42, 57, 97};
  ShellSort(arr);

  // Test 5: N=12
  arr = {69, 24, 36, 66, 81, 90, 83, 5, 3, 36, 13, 63};
  InsertionSort(arr);

  arr = {69, 24, 36, 66, 81, 90, 83, 5, 3, 36, 13, 63};
  ShellSort(arr);
}